{
  "brand": {
    "title": "Get involved with Burning Stories",
    "logoSrc": "/favicon.ico",
    "imageSrc": "/logo.png",
    "beginText": "BEGIN",
    "beginTitle": "Let's get started!"
  },
  "slideDefaults": {
    "title": "Q{{index}}",
    "backText": "BACK",
    "nextText": "NEXT",
    "backTitle": "Go back",
    "nextTitle": "Continue",
    "cancelTitle": "Clear all answers and start again",
    "fields": [{
      "name": "message",
      "type": "textarea",
      "placeholder": "write here...",
      "required": false,
      "autofocus": true,
      "error": "Please write a response!"
    }],
    "diagram": {},
    "settings": { "omitFields": true }
  },
  "slides": [{
    "title": "Welcome to the Burning Stories Forum registration",
    "subtitle": "Welcome to the Burning Stories Forum - an experiment in understanding participatory cultures.<br><br>The following signup will assist us co-creating content based on the collective intelligence of participants to the conference in Aalto University on 31st of March 2020.",
    "body": "In the forum, you can freely engage with any topics you wish and seek the knowledge you find most meaningful. The practical information about the conference at Aalto University will be shared at the forum.",
    "fields": []
  }, {
    "title": "Ready?",
    "body": "What was it that brought you here? What do you really care about right now? You are somehow connected to the global ‘burner’ culture, either as a researcher of it, a leader in it or a co-creator of it or simply interested on it? What are the experiences or interests that pull you towards it?",
    "fields": []
  }, {
    "index": 1,
    "body": "Think back on the last 12 months. Did you go to any ‘burns’? If so, what turned out to be central themes for you this time? If not, you can skip this question."
  }, {
    "index": 2,
    "body": "What are you curious to learn from studying Burning Man and regional burn events and communities?"
  }, {
    "index": 3,
    "title": "The last little bit!",
    "nextTitle": "Submit your response!",
    "body": "<strong>The answers to these question questions will be used to register an account for you to the forum and to introduce you to other participants. Once logged in- you can go back and update your answers.<br><br>Practical information and inspiring content to be discussed will be shared regularly to the forum and also e-mailed to you now and then you as a summary of topics.</strong>",
    "fields": [{
      "name": "name",
      "type": "text",
      "placeholder": "Name/nickname",
      "half": true,
      "required": true,
      "autofocus": true,
      "error": "Please enter your name"
    }, {
      "name": "email",
      "type": "email",
      "placeholder": "E-mail",
      "required": true,
      "error": "Please enter your email address",
      "settings": { "omit": true }
    }, {
      "name": "consent",
      "type": "checkbox",
      "placeholder": "I understand that this form is used for research and that submitting it will create an account for me on the Burning Stories forum.",
      "required": true,
      "error": "Please consent to the terms and conditions",
      "settings": { "omit": true }
    }],
    "nextText": "SEND",
    "submit": true,
    "settings": { "omitBody": true }
  }, {
    "title": "Well done!",
    "body": "Thank you for taking the time to join Burning Stories!",
    "fields": [],
    "backText": null,
    "nextText": null
  }],
  "messages": {
    "networkError": "Sorry, we were unable to store your response due to a network connectivity issue. Please try clicking on \"Send\" again.",
    "username": "It seems somebody has already chosen your preferred username / nickname. Please enter a different one and click again on \"Send\".",
    "email": "It seems you already have an account on our forum using this e-mail address, or have entered an invalid address. Please choose a different e-mail address and click again on \"Send\".",
    "default": "Sorry, we were unable to store your response due to an unknown error. Please try clicking on \"Send\" again."
  }
}
